In [1]:
import pandas as pd

In [49]:
df_2013 = pd.read_csv('totaal_waterplant_2013.csv')
df_2016 = pd.read_csv('totaal_waterplant_2016.csv')

In [51]:
df_2013.loc[:, 'year'] = 2013
df_2016.loc[:, 'year'] = 2016

In [52]:
df = pd.concat((df_2013, df_2016), axis=0)

In [53]:
df.head()

,OBJECTID,TB,TB_class,ID_GEBIED,Beschrijving,x,y,geometry,year
0,1,0.0,0,K17,IJmeer,5.136375,52.324776,POINT (5.136374912311344 52.32477593995228),2013
1,2,0.0,0,K17,IJmeer,5.136365,52.326573,POINT (5.136364764947053 52.32657345535024),2013
2,3,30.0,5,K17,IJmeer,5.130490,52.326562,POINT (5.130489891619272 52.32656175753802),2013
3,4,1.0,1,K17,IJmeer,5.127659,52.326800,POINT (5.127658846768369 52.32680004822095),2013
4,5,1.0,1,K17,IJmeer,5.133120,52.327015,POINT (5.133120387435941 52.32701502041948),2013

In [54]:
df.TB_class.unique()

array([0, 5, 1, 2, 3, 6, 4, 7], dtype=int64)

In [55]:
df.loc[df.TB_class == 7, 'TB_class'] = '75 - 100%'
df.loc[df.TB_class == 6, 'TB_class'] = '50 - 75%'
df.loc[df.TB_class == 5, 'TB_class'] = '25 - 50%'
df.loc[df.TB_class == 4, 'TB_class'] = '15 - 25%'
df.loc[df.TB_class == 3, 'TB_class'] = '05 - 15%'
df.loc[df.TB_class == 2, 'TB_class'] = '01 - 05%'
df.loc[df.TB_class == 1, 'TB_class'] = '00 - 01%'
df.loc[df.TB_class == 0, 'TB_class'] = '00 - 00%'

In [56]:
df.head()

,OBJECTID,TB,TB_class,ID_GEBIED,Beschrijving,x,y,geometry,year
0,1,0.0,00 - 00%,K17,IJmeer,5.136375,52.324776,POINT (5.136374912311344 52.32477593995228),2013
1,2,0.0,00 - 00%,K17,IJmeer,5.136365,52.326573,POINT (5.136364764947053 52.32657345535024),2013
2,3,30.0,25 - 50%,K17,IJmeer,5.130490,52.326562,POINT (5.130489891619272 52.32656175753802),2013
3,4,1.0,00 - 01%,K17,IJmeer,5.127659,52.326800,POINT (5.127658846768369 52.32680004822095),2013
4,5,1.0,00 - 01%,K17,IJmeer,5.133120,52.327015,POINT (5.133120387435941 52.32701502041948),2013

In [57]:
df_sel = df[['TB', 'TB_class', 'Beschrijving', 'year', 'x', 'y']]

In [58]:
df_sel.columns = ['waterplant_pct', 'waterplant_class', 'region', 'year', 'x', 'y']

In [59]:
df_sel.to_csv('waterplanten.csv')

In [24]:
df_v = pd.read_json(r"T:\@Marc\4142.10_MIJ-Brein\vogels.json")

In [44]:
df_v[df_v.birdname == 'Aalscholver']

     year                 in    function     birdname  birdcount
0    2012  seizoen gemiddeld  foerageren  Aalscholver       3305
1    2012        seizoen max      slapen  Aalscholver        317
26   2013  seizoen gemiddeld  foerageren  Aalscholver       3002
27   2013        seizoen max      slapen  Aalscholver        152
52   2014  seizoen gemiddeld  foerageren  Aalscholver       3607
53   2014        seizoen max      slapen  Aalscholver        506
78   2015  seizoen gemiddeld  foerageren  Aalscholver       2345
79   2015        seizoen max      slapen  Aalscholver        448
104  2016  seizoen gemiddeld  foerageren  Aalscholver       3310
105  2016        seizoen max      slapen  Aalscholver        450
130  2017  seizoen gemiddeld  foerageren  Aalscholver       2496
131  2017        seizoen max      slapen  Aalscholver        251

In [46]:
df_v_sel = df_v[['year', 'function', 'birdname', 'birdcount']]

In [47]:
df_v_sel.to_csv('vogels.csv')

In [40]:
#pd.concat((df_v, df_sel), axis=1)

In [39]:
#pd.merge(df_sel, df_v, how='left', left_on='year', right_on='year' ,)

In [34]:
df_all.to_csv('waterplant_vogel.csv')

In [36]:
df_v.shape

(156, 5)

In [37]:
df_sel.shape

(7575, 6)